tutorials/flame1D_phi1.0/0_orig/N2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.724664;

boundaryField
{
    left
    {
        type            fixedValue;
        value           uniform 0.724664;
    }
    right
    {
        type            zeroGradient;
    }
    sides
    {
        type            empty;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //