tutorials/flame1D_phi1.0/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    left
    {
        type            patch;
        nFaces          1;
        startFace       1999;
    }
    right
    {
        type            patch;
        nFaces          1;
        startFace       2000;
    }
    sides
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4000;
        startFace       2001;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4000;
        startFace       6001;
    }
)

// ************************************************************************* //
