tutorials/flame1D_phi1.0/constant/reactions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Reference:
    Bui-Pham, M. N. (1992).
    Studies in structures of lam inar hydrocarbon flames.
    PhD Thesis, University of California, San Diego

Notes:
    This mechanism was developed for simulating this exact counter-flow flame
    configuration. It should not be considered general-purpose.

\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       IOobject;
    object      reactions;
}

elements
4
(
    O
    H
    C
    N
);

species
6
(
    O2
    H2O
    CH4
    CO2
    N2
    CO
);


reactions
{
    R1
    {
        type     	irreversibleArrheniusExtendReaction;
        reaction	"CH4^0.5 + 1.5O2^0.65 = CO + 2H2O";
        A		1738728867.8;
        beta     	0;
        Ta       	17863.3;
        phi       1;
    }

    R2
    {
        type     	irreversibleArrheniusExtendReaction;
        reaction 	"CO^1 + 0.5O2^0.5 = CO2";
        A        	4916076.0;
        beta     	0.7;
        Ta       	6038.29;
        phi       1;
    }


}

// ************************************************************************* //
