tutorials/flame1D_phi1.0/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// 1D канал, ось x — направление распространения пламени.
// dx = 0.025 mm, длина 0.05 m -> 2000 ячеек.

scale   1;

vertices
(
    (0.0    0       0)      // 0
    (0.05   0       0)      // 1
    (0.05   0.0001  0)      // 2
    (0.0    0.0001  0)      // 3
    (0.0    0       0.0001) // 4
    (0.05   0       0.0001) // 5
    (0.05   0.0001  0.0001) // 6
    (0.0    0.0001  0.0001) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (2000 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    sides
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (3 2 6 7)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
