tutorials/flame1D_phi1.0/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            sets;

libs            ("libsampling.so");

interpolationScheme cellPoint;

writeFormat     raw;

setFormat       raw;

fields
(
    T
    U
    p
    CH4
    O2
    CO2
);

sets
(
    lineX
    {
        type        uniform;
        axis        x;
        start       (0 0.00005 0.00005);
        end         (0.05 0.00005 0.00005);
        nPoints     500;
    }
);

// ************************************************************************* //
